src/Documents/ПланированиеОтсутствия/ПланированиеОтсутствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланированиеОтсутствия</name>
  <registerRecords>InformationRegister.ПлановыеОтсутствия</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ПА_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ПА_Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ПлановыеОтсутствия/ПлановыеОтсутствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеОтсутствия</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ПА_Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПланированиеОтсутствия/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ПлановыеОтсутствия
	Движения.ПлановыеОтсутствия.Записывать = Истина;
	Движение = Движения.ПлановыеОтсутствия.Добавить();
	Движение.ДатаНачала = ДатаНачала;
	Движение.ДатаОкончания = ДатаОкончания;
	Движение.Сотрудник = Сотрудник;


КонецПроцедуры
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
